-- (по желанию) Пусть имеется таблица с календарным полем created_at. 
-- В ней размещены разряженые календарные записи за август 2018 года '2018-08-01', '2016-08-04', '2018-08-16' 
-- и 2018-08-17. Составьте запрос, который выводит полный список дат за август, 
-- выставляя в соседнем поле значение 1, если дата присутствует в исходном таблице и 0, если она отсутствует.

CREATE TABLE august (
created_at DATETIME);

INSERT into august VALUES
 ('2018-08-01'),
 ('2018-08-04'),
 ('2018-08-16'),
 ('2018-08-17');

SELECT * FROM august;
SELECT date, count(event) FROM table1
WHERE date BETWEEN '2018-08-01' AND '2018-08-31'
GROUP BY DAY(date)
ORDER by date;


CREATE TEMPORARY TABLE date (
 created_at DATETIME);
INSERT INTO date VALUES
 ('2018-08-01'),
 ('2018-08-02'),
 ('2018-08-03'),
 ('2018-08-04'),
 ('2018-08-05'),
 ('2018-08-06'),
 ('2018-08-07'),
 ('2018-08-08'),
 ('2018-08-09'),
 ('2018-08-10'),
 ('2018-08-11'),
 ('2018-08-12'),
 ('2018-08-13'),
 ('2018-08-14'),
 ('2018-08-15'),
 ('2018-08-16'),
 ('2018-08-17'),
 ('2018-08-18'),
 ('2018-08-19'),
 ('2018-08-20'),
 ('2018-08-21'),
 ('2018-08-22'),
 ('2018-08-23'),
 ('2018-08-24'),
 ('2018-08-25'),
 ('2018-08-26'),
 ('2018-08-27'),
 ('2018-08-28'), 
 ('2018-08-29'),
 ('2018-08-30'),
 ('2018-08-31');

SELECT created_at AS,
  IF(august.created_at IN date.created_at, '1', '0') AS status
   FROM date
  LEFT JOIN august
  ON august.created_at = date.created_at; 


